---
kind: method
id: M:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralT.GetFlangeThicknessInQuarterWidth
source: html/2f336e46-1aa3-1a9a-9482-f8587aed1a86.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralT.GetFlangeThicknessInQuarterWidth Method

Returns thickness of flange measured in the 0.25 * width,
 sometimes used for sections with width <= 300 mm.

## Syntax (C#)
```csharp
public double GetFlangeThicknessInQuarterWidth()
```